<?php
$a = [
	'钱斌',
	'张小雪',
	'彭凯',
	'陈洪升',
	'王晟源',
	'周锐',
	'陈伟武',
	'黄晓俊',
	'张志勇',
	'幸俊',
	'李金珠',
	'卢伟鸿',
	'冯文强',
	'冯婕',
	'江玫莹',
	'周惠子',
	'余雄伟',
	'谭凯维',
	'廖晓怡',
	'邹锐',
	'周家俊',
	'张以立',
	'郭渝',
	'谭梓琪',
	'张远智',
	'潘博',
	'杨树青',
	'李滔',
	'李坤志',
	'夏丹丹',
	'张福炜',
	'冯江尧',
	'陈泽仕',
	'黄豪强',
	'晏晓利',
	'许智源',
	'李子豪',
];

$b = [
	['冯江尧', 3],
	['黄晓俊', 3],
	['梁芝', 4],
	['赵志伟', 3],
	['陈泽仕', 3],
	['张远智', 3],
	['钱斌', 4],
	['张小雪', 3],
	['彭凯', 3],
	['陈洪升', 4],
	['陈伟武', 3],
	['张志勇', 3],
	['冯文强', 4],
	['邱国盛', 3],
	['张知通', 4],
	['杨树青', 3],
	['冯婕', 4],
	['潘博', 4],
	['钱沐云', 3],
	['曹颖丽', 3],
	['李子豪', 3],
	['王晟源', 3],
	['李滔', 3],
	['陈柱伟', 3],
	['幸俊', 2],
	['李坤志', 3],
	['夏丹丹', 3],
	['王守林', 3],
	['黄豪强', 5],
	['廖俊锋', 1],
	['晏晓利', 5],
	['雷海钦', 2],
	['文鹏山', 5],
	['许智源', 3],
	['周锐', 3],
	['李金珠', 3],
	['张福炜', 3],
	['卢伟鸿', 4],
];

$qw = [];
foreach($a as $_a){
	$found = false;
	foreach($b as list($name, $score)){
		if($name == $_a){
			$qw[$_a] = $score;
//			echo $score, PHP_EOL;
			$found = true;
		}
	}
	if(!$found){
//		echo "-", PHP_EOL;
		$qw[$_a] = '--';
	}
}


$nqw = [];
foreach($b as list($name, $score)){
	if(!in_array($name, $a)){
		$nqw[$name] = $score;
		echo $name, ", ", $score, PHP_EOL;
	}
}
die;
var_dump($qw);